thtfcccj/Misc/PIC/Pic16f193xBit.h
/*****************************************************************************************
                                PIC16F193x位定义文件                                  

*****************************************************************************************/
#ifndef __PIC16F193X_BIT_H
#define __PIC16F193X_BIT_H

//PICB = PIC+BIT
// Register: STATUS
#define  PICB_CARRY             0x01
#define  PICB_DC                0x02
#define  PICB_ZERO              0x04
#define  PICB_nPD               0x08
#define  PICB_nTO               0x10

// Register: BSR
#define  PICB_BSR0              0x01
#define  PICB_BSR1              0x02
#define  PICB_BSR2              0x04
#define  PICB_BSR3              0x08
#define  PICB_BSR4              0x10

// Register: INTCON
// bit and bitfield definitions
#define  PICB_IOCIF             0x01
#define  PICB_INTF              0x02
#define  PICB_TMR0IF            0x04
#define  PICB_IOCIE             0x08
#define  PICB_INTE              0x10
#define  PICB_TMR0IE            0x20  
#define  PICB_PEIE              0x40
#define  PICB_GIE               0x80
#define  PICB_T0IF              0x04
#define  PICB_T0IE               

// Register: PORTA
#define  PICB_RA0               0x01
#define  PICB_RA1               0x02
#define  PICB_RA2               0x04
#define  PICB_RA3               0x08
#define  PICB_RA4               0x10
#define  PICB_RA5               0x20
#define  PICB_RA6               0x40
#define  PICB_RA7               0x80

// Register: PORTB
#define  PICB_RB0             0x01
#define  PICB_RB1             0x02
#define  PICB_RB2             0x04
#define  PICB_RB3             0x08
#define  PICB_RB4             0x10
#define  PICB_RB5             0x20
#define  PICB_RB6             0x40
#define  PICB_RB7             0x80

// Register: PORTC
#define  PICB_RC0                   0x01
#define  PICB_RC1                   0x02
#define  PICB_RC2                   0x04
#define  PICB_RC3                   0x08
#define  PICB_RC4                   0x10
#define  PICB_RC5                   0x20
#define  PICB_RC6                   0x40
#define  PICB_RC7                   0x80
// Register: PORTE
#define  PICB_RE3                   0x08

// Register: PIR1
// TMR1 Overflow Interrupt Flag bit
#define  PICB_TMR1IF                0x01
// TMR2 to PR2 Match Interrupt Flag bit
#define  PICB_TMR2IF                0x02
// CCP1 Interrupt Flag bit
#define  PICB_CCP1IF                0x04
// Master Synchronous Serial Port (MSSP) Interrupt Flag bit
#define  PICB_SSPIF                 0x08
// EUSART Transmit Interrupt Flag bit
#define  PICB_TXIF                  0x10
// EUSART Receive Interrupt Flag bit
#define  PICB_RCIF                  0x20
// /D Converter Interrupt Flag bit
#define  PICB_ADIF                  0x40
// Timer1 Gate Interrupt Flag bit
#define  PICB_TMR1GIF               0x80

// Register: PIR2
#define  PICB_CCP2IF                0x01
#define  PICB_LCDIF                 0x04
#define  PICB_BCLIF                 0x08
#define  PICB_EEIF                  0x10
#define  PICB_C1IF                  0x20
#define  PICB_C2IF                  0x40
#define  PICB_OSFIF                 0x80

// Register: PIR3
#define  PICB_TMR4IF                0x02
#define  PICB_TMR6IF                0x08
#define  PICB_CCP3IF                0x10
#define  PICB_CCP4IF                0x20
#define  PICB_CCP5IF                0x40

// Register: T1CON
#define  PICB_TMR1ON                0x01
#define  PICB_nT1SYNC               0x04
#define  PICB_T1OSCEN               0x08
#define  PICB_T1CKPS0               0x10
#define  PICB_T1CKPS1               0x20
#define  PICB_TMR1CS0               0x40
#define  PICB_TMR1CS1               0x80

// Register: T1GCON
#define  PICB_T1GSS0                0x01
#define  PICB_T1GSS1                0x02
#define  PICB_T1GVAL                0x04
#define  PICB_T1GGO_nDONE           0x08
#define  PICB_T1GSPM                0x10
#define  PICB_T1GTM                 0x20
#define  PICB_T1GPOL                0x40
#define  PICB_TMR1GE                0x80
#define  PICB_T1GGO                 0x08

// Register: T2CON
#define  PICB_T2CKPS0               0x01
#define  PICB_T2CKPS1               0x02
#define  PICB_TMR2ON                0x04
#define  PICB_T2OUTPS0              0x08
#define  PICB_T2OUTPS1              0x10
#define  PICB_T2OUTPS2              0x20
#define  PICB_T2OUTPS3              0x40

// Register: CPSCON0
#define  PICB_T0XCS                 0x01
#define  PICB_CPSOUT                0x02
#define  PICB_CPSRNG0               0x04
#define  PICB_CPSRNG1               0x08
#define  PICB_CPSON                 0x80

// Register: CPSCON1
#define  PICB_CPSCH0                0x01
#define  PICB_CPSCH1                0x02
#define  PICB_CPSCH2                0x04

// Register: TRISA
// PORTA Data Direction Control Register
#define  PICB_TRISA0                0x01
#define  PICB_TRISA1                0x02
#define  PICB_TRISA2                0x04
#define  PICB_TRISA3                0x08
#define  PICB_TRISA4                0x10
#define  PICB_TRISA5                0x20
#define  PICB_TRISA6                0x40
#define  PICB_TRISA7                0x80

// Register: TRISB
// bit and bitfield definitions
#define  PICB_TRISB0               0x01
#define  PICB_TRISB1               0x02
#define  PICB_TRISB2               0x04
#define  PICB_TRISB3               0x08
#define  PICB_TRISB4               0x10
#define  PICB_TRISB5               0x20
#define  PICB_TRISB6               0x40
#define  PICB_TRISB7               0x80

// Register: TRISC
// PORTC Data Direction Control Register
#define  PICB_TRISC0                0x01
#define  PICB_TRISC1                0x02
#define  PICB_TRISC2                0x04
#define  PICB_TRISC3                0x08
#define  PICB_TRISC4                0x10
#define  PICB_TRISC5                0x20
#define  PICB_TRISC6                0x40
#define  PICB_TRISC7                0x80

// Register: TRISE
#define  PICB_TRISE3                0x08

// Register: PIE1
// bit and bitfield definitions
// TMR1 Overflow Interrupt Enable bit
#define  PICB_TMR1IE                0x01
// TMR2 to PR2 Match Interrupt Enable bit
#define  PICB_TMR2IE                0x02
// CCP1 Interrupt Enable bit
#define  PICB_CCP1IE                0x04
// Master Synchronous Serial Port (MSSP) Interrupt Enable bit
#define  PICB_SSPIE                 0x08
// EUSART Transmit Interrupt Enable bit
#define  PICB_TXIE                  0x10
// EUSART Receive Interrupt Enable bit
#define  PICB_RCIE                  0x20
// /D Converter Interrupt Enable bit
#define  PICB_ADIE                  0x40
// Timer1 Gate Interrupt Enable bit
#define  PICB_TMR1GIE               0x80


// Register: PIE2
// bit and bitfield definitions
// CCP2 Interrupt Enable bit
#define  PICB_CCP2IE                0x01
// LCD Module Interrupt Enable bit
#define  PICB_LCDIE                 0x04
// MSSP Bus Collision Interrupt Interrupt Enable bit
#define  PICB_BCLIE                 0x08
// EEPROM Write Completion Interrupt Enable bit
#define  PICB_EEIE                  0x10
// Comparator C1 Interrupt Enable bit
#define  PICB_C1IE                  0x20
// Comparator C2 Interrupt Enable bit
#define  PICB_C2IE                  0x40
// CCP2 Interrupt Enable bit
#define  PICB_OSFIE                 0x80

// Register: PIE3
// bit and bitfield definitions
// TMR4 to PR4 Match Interrupt Enable bit
#define  PICB_TMR4IE                0x02
// TMR6 to PR6 Match Interrupt Enable bit
#define  PICB_TMR6IE                0x08
// CCP3 Interrupt Enable bit
#define  PICB_CCP3IE                0x10
// CCP4 Interrupt Enable bit
#define  PICB_CCP4IE                0x20
// CCP5 Interrupt Enable bit
#define  PICB_CCP5IE                0x40

// Register: OPTION_REG
// Option Register
// Prescaler Rate Select bits
#define  PICB_PS0                   0x01
// Prescaler Rate Select bits
#define  PICB_PS1                   0x02
// Prescaler Rate Select bits
#define  PICB_PS2                   0x04
// Prescaler Active bit
#define  PICB_PSA                   0x08
// TMR0 Source Edge Select bit
#define  PICB_TMR0SE                0x10
// TMR0 Clock Source Select bit
#define  PICB_TMR0CS                0x20
// Interrupt Edge Select bit
#define  PICB_INTEDG                0x40
// Weak Pull-up Enable bit
#define  PICB_nWPUEN                0x80
#define  PICB_T0SE                  0x10
#define  PICB_T0CS                  

// Register: PCON
// bit and bitfield definitions
// Brown-out Reset Status bit
#define  PICB_nBOR                  0x01
// Power-on Reset Status bit
#define  PICB_nPOR                  0x02
// RESET Instruction Flag bit
#define  PICB_nRI                   0x04
// MCLR Reset Flag bit
#define  PICB_nRMCLR                0x08
// Stack Underflow Flag bit
#define  PICB_STKUNF                0x40
// Stack Overflow Flag bit
#define  PICB_STKOVF                0x80

// Register: WDTCON
// Watchdog Timer Control Register
// Software Enable/Disable for Watch Dog Timer bit
#define  PICB_SWDTEN                0x01
// Watchdog Timer Period Select bits
#define  PICB_WDTPS0                0x02
// Watchdog Timer Period Select bits
#define  PICB_WDTPS1                0x04
// Watchdog Timer Period Select bits
#define  PICB_WDTPS2                0x08
// Watchdog Timer Period Select bits
#define  PICB_WDTPS3                0x10
// Watchdog Timer Period Select bits
#define  PICB_WDTPS4                

