thtfcccj/Misc/PIC/Pic16f193xBit.h
// Register: OSCTUNE
// bit and bitfield definitions
// Frequency Tuning bits
#define  PICB_TUN0                  0x01
// Frequency Tuning bits
#define  PICB_TUN1                  0x02
// Frequency Tuning bits
#define  PICB_TUN2                  0x04
// Frequency Tuning bits
#define  PICB_TUN3                  0x08
// Frequency Tuning bits
#define  PICB_TUN4                  0x10
// Frequency Tuning bits
#define  PICB_TUN5                  

// Register: OSCCON
// bit and bitfield definitions
// System clock select bit
#define  PICB_SCS0                  0x01
// System clock select bit
#define  PICB_SCS1                  0x02
// Internal Oscillator Frequency Select bits
#define  PICB_IRCF0                 0x08
// Internal Oscillator Frequency Select bits
#define  PICB_IRCF1                 0x10
// Internal Oscillator Frequency Select bits
#define  PICB_IRCF2                 0x20
// Internal Oscillator Frequency Select bits
#define  PICB_IRCF3                 0x40
// Software PLL Enable bit
#define  PICB_SPLLEN                0x80

// Register: OSCSTAT
// Oscillator Status Register
// bit and bitfield definitions
// Low Freqency Internal Oscillator Ready bit
#define  PICB_HFIOFS                0x01
// Low Freqency Internal Oscillator Ready bit
#define  PICB_LFIOFR                0x02
// Medium Freqency Internal Oscillator Ready bit
#define  PICB_MFIOFR                0x04
// High Freqency Internal Oscillator Status Locked bit
#define  PICB_HFIOFL                0x08
// High Freqency Internal Oscillator Ready bit
#define  PICB_HFIOFR                0x10
// Oscillator Start-up Time-out Status bit
#define  PICB_OSTS                  0x20
// 4x PLL Ready bit
#define  PICB_PLLR                  0x40
// Timer1 Oscillator Ready bit
#define  PICB_T1OSCR                0x80

// bit and bitfield definitions
// /D Module Enable bit
#define  PICB_ADON                  0x01
// /D Conversion Status bit
#define  PICB_GO_nDONE              0x02
// Analog Channel Select bits
#define  PICB_CHS0                  0x04
// Analog Channel Select bits
#define  PICB_CHS1                  0x08
// Analog Channel Select bits
#define  PICB_CHS2                  0x10
// Analog Channel Select bits
#define  PICB_CHS3                  
// Analog Channel Select bits
#define  PICB_CHS4                  0x40
// /D Conversion Status bit
#define  PICB_ADGO                  0x02
// /D Conversion Status bit
#define  PICB_GO                    0x02
// /D Conversion Status bit
#define  PICB_nDONE                 0x02

// Register: ADCON1
// Analog-to-Digital Control Register 1
// /D Positive Voltage Reference Configuration
#define  PICB_ADPREF0               0x01
// /D Positive Voltage Reference Configuration
#define  PICB_ADPREF1               0x02
// /D Negative Voltage Reference Configuration
#define  PICB_ADNREF                0x04
// /D Conversion Clock Select bits
#define  PICB_ADCS0                 0x10
// /D Conversion Clock Select bits
#define  PICB_ADCS1                 0x20
// /D Conversion Clock Select bits
#define  PICB_ADCS2                 0x40
// /D Result Format Select bit
#define  PICB_ADFM                  0x80

//
// Special function register definitions: Bank 2
//


// Register: LATA
#define  PICB_LATA0                 0x01
#define  PICB_LATA1                 0x02
#define  PICB_LATA2                 0x04
#define  PICB_LATA3                 0x08
#define  PICB_LATA4                 0x10
#define  PICB_LATA5                 0x20
#define  PICB_LATA6                 0x40
#define  PICB_LATA7                 0x80

// Register: LATB
#define  PICB_LATB0                 0x01
#define  PICB_LATB1                 0x02
#define  PICB_LATB2                 0x04
#define  PICB_LATB3                 0x08
#define  PICB_LATB4                 0x10
#define  PICB_LATB5                 0x20
#define  PICB_LATB6                 0x40
#define  PICB_LATB7                 0x80


// Register: LATC
#define  PICB_LATC0                 0x01
#define  PICB_LATC1                 0x02
#define  PICB_LATC2                 0x04
#define  PICB_LATC3                 0x08
#define  PICB_LATC4                 0x10
#define  PICB_LATC5                 0x20
#define  PICB_LATC6                 0x40
#define  PICB_LATC7                 0x80

// Register: LATE
#define  PICB_LATE3                 0x08

// Register: CM1CON0
// Comparator Output Synchronous Mode bit
#define  PICB_C1SYNC                0x01
// Comparator Hysteresis Enable bit
#define  PICB_C1HYS                 0x02
// Comparator Speed/Power Select bit
#define  PICB_C1SP                  0x04
// Comparator Output Polarity Select bit
#define  PICB_C1POL                 0x10
// Comparator Output Enable bit
#define  PICB_C1OE                  0x20
// Comparator Output bit
#define  PICB_C1OUT                 0x40
// Comparator Enable bit
#define  PICB_C1ON                  0x80

// Register: CM1CON1
// bit and bitfield definitions
// Comparator Negative Input Channel Select bits
#define  PICB_C1NCH0                0x01
// Comparator Negative Input Channel Select bits
#define  PICB_C1NCH1                0x02
// Comparator Positive Input Channel Select bits
#define  PICB_C1PCH0                0x10
// Comparator Positive Input Channel Select bits
#define  PICB_C1PCH1                0x20
// Comparator Interrupt on Negative going edge Enable bits
#define  PICB_C1INTN                0x40
// Comparator Interrupt on Positive going edge Enable bits
#define  PICB_C1INTP                0x80

// Register: CM2CON0
#define  PICB_C2SYNC                0x01
#define  PICB_C2HYS                 0x02
#define  PICB_C2SP                  0x04
#define  PICB_C2POL                 0x10
#define  PICB_C2OE                  0x20
#define  PICB_C2OUT                 0x40
#define  PICB_C2ON                  0x80

// Register: CM2CON1
// Comparator Negative Input Channel Select bits
#define  PICB_C2NCH0                0x01
// Comparator Negative Input Channel Select bits
#define  PICB_C2NCH1                0x02
// Comparator Positive Input Channel Select bits
#define  PICB_C2PCH0                0x10
// Comparator Positive Input Channel Select bits
#define  PICB_C2PCH1                0x20
// Comparator Interrupt on Negative going edge Enable bits
#define  PICB_C2INTN                0x40
// Comparator Interrupt on Positive going edge Enable bits
#define  PICB_C2INTP                0x80

// Register: CMOUT
// bit and bitfield definitions
#define  PICB_MC1OUT                0x01
#define  PICB_MC2OUT                0x02

// Register: BORCON
// Brown-out Reset Control Register
// Brown-out Reset Circuit Ready Status bit
#define  PICB_BORRDY                0x01
// Software Brown Out Reset Enable bit
#define  PICB_SBOREN                0x80

// Register: FVRCON
// Voltage Reference Control Register 0
// /D Converter Fixed Voltage Reference Selection
#define  PICB_ADFVR0                0x01
// /D Converter Fixed Voltage Reference Selection
#define  PICB_ADFVR1                0x02
// Comparator and D/ Converter Fixed Voltage Reference Selection
#define  PICB_CDAFVR0               0x04
// Comparator and D/ Converter Fixed Voltage Reference Selection
#define  PICB_CDAFVR1               0x08
// Temperature Indicator Range Selection
#define  PICB_TSRNG                 0x10
// Temperature Indicator Enable
#define  PICB_TSEN                  0x20
// Fixed Voltage Reference Ready Flag
#define  PICB_FVRRDY                0x40
// Fixed Voltage Reference Enable
#define  PICB_FVREN                 0x80

// Register: DACCON0
// Voltage Reference Control Register 1
// DAC1 Negative Source Select bits
#define  PICB_DACNSS                0x01
// DAC1 Positive Source Select bits
#define  PICB_DACPSS0               0x04
// DAC1 Positive Source Select bits
#define  PICB_DACPSS1               0x08
// DAC1 Voltage Output Enable bit
#define  PICB_DACOE                 0x20
// DAC 1 Low Power Voltage State Select bit
#define  PICB_DACLPS                0x40
// DAC 1 Enable bit
#define  PICB_DACEN                 0x80

// Register: DACCON1
// bit and bitfield definitions
// DAC1 Voltage Output Select bits
#define  PICB_DACR0                 0x01
// DAC1 Voltage Output Select bits
#define  PICB_DACR1                 0x02
// DAC1 Voltage Output Select bits
#define  PICB_DACR2                 0x04
// DAC1 Voltage Output Select bits
#define  PICB_DACR3                 0x08
// DAC1 Voltage Output Select bits
#define  PICB_DACR4                 0x10

// Register: SRCON0
// SR Latch Control Register 0
// Pulse Reset Input of the SR Latch
#define  PICB_SRPR                  0x01
// Pulse Set Input of the SR Latch
#define  PICB_SRPS                  0x02
// SR Latch Q Output Enable bit
#define  PICB_SRNQEN                0x04
// SR Latch Q Output Enable bit
#define  PICB_SRQEN                 0x08
// SR Latch Clock divider bits
#define  PICB_SRCLK0                0x10
// SR Latch Clock divider bits
#define  PICB_SRCLK1                0x20
// SR Latch Clock divider bits
#define  PICB_SRCLK2                0x40
// SR Latch Enable bit
#define  PICB_SRLEN                 0x80

// Register: SRCON1
// SR Latch Control Register 1
// SR Latch C1 Reset Enable bit
#define  PICB_SRRC1E                0x01
// SR Latch C2 Reset Enable bit
#define  PICB_SRRC2E                0x02
// SR Latch Reset Clock Enable bit
#define  PICB_SRRCKE                0x04
// SR Latch Peripheral Reset Enable bit
#define  PICB_SRRPE                 0x08
// SR Latch C1 Set Enable bit
#define  PICB_SRSC1E                0x10
// SR Latch C2 Set Enable bit
#define  PICB_SRSC2E                0x20
// SR Latch Set Clock Enable bit
#define  PICB_SRSCKE                0x40
// SR Latch Peripheral Set Enable bit
#define  PICB_SRSPE                 0x80

// Register: APFCON
// bit and bitfield definitions
// CCP2 Input/Output Pin Selection
//注：193x与194x位定义不同，下为193X的位定义
#define  PICB_CCP2SEL               0x01
// SS Input Pin Selection
#define  PICB_SSSEL                 0x02
// Comparator 2 Output Pin Selection
#define  PICB_C2OUTSEL              0x04
// SR Latch nQ Output Pin Selection
#define  PICB_SRNQSEL               0x08
// CCP2 PWM B Output Pin Selection
#define  PICB_P2BSEL                0x10
// Timer1 Gate Input Pin Selection
#define  PICB_T1GSEL                0x20
// CCP3 Input/Output Pin Selection
#define  PICB_CCP3SEL               0x40

//
// Special function register definitions: Bank 3
//


// Register: ANSELA
#define  PICB_ANSA0                 0x01
#define  PICB_ANSA1                 0x02
#define  PICB_ANSA2                 0x04
#define  PICB_ANSA3                 0x08
#define  PICB_ANSA4                 0x10
#define  PICB_ANSA5                 0x20

// Register: ANSELB
#define  PICB_ANSB0             0x01
#define  PICB_ANSB1             0x02
#define  PICB_ANSB2             0x04
#define  PICB_ANSB3             0x08
#define  PICB_ANSB4             0x10
#define  PICB_ANSB5             0x20

// Register: EECON1
// Read Control bit
#define  PICB_RD                    0x01
// Write Control bit
#define  PICB_WR                    0x02
// Program/Erase Enable bit
#define  PICB_WREN                  0x04
// Sequence Error Flag bit
#define  PICB_WRERR                 0x08
// Program FLASH Erase Enable bit
#define  PICB_FREE                  0x10
// Load Write Latches Only bit
#define  PICB_LWLO                  0x20
// FLASH Program / Data EEPROM or Configuration Select bit
#define  PICB_CFGS                  0x40
// FLASH Program / Data EEPROM Memory Select bit
#define  PICB_EEPGD                 0x80

