thtfcccj/Misc/PIC/Pic16f193xBit.h
// Register: RCSTA
// Receive Status and Control Register
// 9th bit of received data (can be parity bit)
#define  PICB_RX9D                  0x01
// Overrun Error bit
#define  PICB_OERR                  0x02
// Framing Error bit
#define  PICB_FERR                  0x04
// Address Detect Enable bit
#define  PICB_ADDEN                 0x08
// Continuous Receive Enable bit
#define  PICB_CREN                  0x10
// Single Receive Enable bit
#define  PICB_SREN                  0x20
// 9-bit Receive Enable bit
#define  PICB_RX9                   0x40
// Serial Port Enable bit
#define  PICB_SPEN                  0x80

// Register: TXSTA
// Transmit Status and Control Register
// 9th bit of transmit data can be used as parity bit
#define  PICB_TX9D                  0x01
// Transmit Operation Idle Status bit
#define  PICB_TRMT                  0x02
// High Baud Rate Select bit
#define  PICB_BRGH                  0x04
// Send BREAK character bit
#define  PICB_SENDB                 0x08
// USART Mode Select bit
#define  PICB_SYNC                  0x10
// Transmit Enable bit
#define  PICB_TXEN                  0x20
// 9-bit Transmit Enable bit
#define  PICB_TX9                   0x40
// Clock Source Select bit
#define  PICB_CSRC                  0x80

// Register: BAUDCON
// Baud Rate Control Register
// Auto-Baud Detect Enable bit
#define  PICB_ABDEN                 0x01
// Wake-Up Enable bit
#define  PICB_WUE                   0x02
// 16-bit Baud Rate Register enable bit
#define  PICB_BRG16                 0x08
// Clock/Transmit Polarity Select bit
#define  PICB_SCKP                  0x10
// Receive Operation Idle Status bit
#define  PICB_RCIDL                 0x40
// BRG Rollover Status bit
#define  PICB_ABDOVF                0x80

//
// Special function register definitions: Bank 4
//


// Register: WPUB
#define  PICB_WPUB0                 0x01
#define  PICB_WPUB1                 0x02
#define  PICB_WPUB2                 0x04
#define  PICB_WPUB3                 0x08
#define  PICB_WPUB4                 0x10
#define  PICB_WPUB5                 0x20
#define  PICB_WPUB6                 0x40
#define  PICB_WPUB7                 0x80

// Register: WPUE
#define  PICB_WPUE3                 0x08

// Register: SSPSTAT
#define  PICB_BF                    0x01
#define  PICB_UA                    0x02
#define  PICB_R_nW                  0x04
#define  PICB_S                     0x08
#define  PICB_P                     0x10
#define  PICB_D_nA                  0x20
#define  PICB_CKE                   0x40
#define  PICB_SMP                   0x80

// Register: SSPCON1
#define  PICB_SSPM0                 0x01
#define  PICB_SSPM1                 0x02
#define  PICB_SSPM2                 0x04
#define  PICB_SSPM3                 0x08
#define  PICB_CKP                   0x10
#define  PICB_SSPEN                 0x20
#define  PICB_SSPOV                 0x40
#define  PICB_WCOL                  0x80

// Register: SSPCON2
#define  PICB_SEN                   0x01
#define  PICB_RSEN                  0x02
#define  PICB_PEN                   0x04
#define  PICB_RCEN                  0x08
#define  PICB_ACKEN                 0x10
#define  PICB_ACKDT                 0x20
#define  PICB_ACKSTAT               0x40
#define  PICB_GCEN                  0x80


// Register: SSPCON3
#define  PICB_DHEN                  0x01
#define  PICB_AHEN                  0x02
#define  PICB_SBCDE                 0x04
#define  PICB_SDAHT                 0x08
#define  PICB_BOEN                  0x10
#define  PICB_SCIE                  0x20
#define  PICB_PCIE                  0x40
#define  PICB_ACKTIM                0x80

//
// Special function register definitions: Bank 5
//

#define  PICB_CCP1M0                0x01
#define  PICB_CCP1M1                0x02
#define  PICB_CCP1M2                0x04
#define  PICB_CCP1M3                0x08
#define  PICB_DC1B0                 0x10
#define  PICB_DC1B1                 0x20
#define  PICB_P1M0                  0x40
#define  PICB_P1M1                  0x80

// Register: PWM1CON
#define  PICB_P1DC0                 0x01
#define  PICB_P1DC1                 0x02
#define  PICB_P1DC2                 0x04
#define  PICB_P1DC3                 0x08
#define  PICB_P1DC4                 0x10
#define  PICB_P1DC5                 0x20
#define  PICB_P1DC6                 0x40
#define  PICB_P1RSEN                0x80

// Register: CCP1AS
#define  PICB_PSS1BD0               0x01
#define  PICB_PSS1BD1               0x02
#define  PICB_PSS1AC0               0x04
#define  PICB_PSS1AC1               0x08
#define  PICB_CCP1AS0               0x10
#define  PICB_CCP1AS1               0x20
#define  PICB_CCP1AS2               0x40
#define  PICB_CCP1ASE               0x80

// Register: PSTR1CON
#define  PICB_STR1A                 0x01
#define  PICB_STR1B                 0x02
#define  PICB_STR1C                 0x04
#define  PICB_STR1D                 0x08
#define  PICB_STR1SYNC              0x10

// bit and bitfield definitions
#define  PICB_CCP2M0                0x01
#define  PICB_CCP2M1                0x02
#define  PICB_CCP2M2                0x04
#define  PICB_CCP2M3                0x08
#define  PICB_DC2B0                 0x10
#define  PICB_DC2B1                 0x20
#define  PICB_P2M0                  0x40
#define  PICB_P2M1                  0x80


// Register: PWM2CON
#define  PICB_P2DC0                 0x01
#define  PICB_P2DC1                 0x02
#define  PICB_P2DC2                 0x04
#define  PICB_P2DC3                 0x08
#define  PICB_P2DC4                 0x10
#define  PICB_P2DC5                 0x20
#define  PICB_P2DC6                 0x40
#define  PICB_P2RSEN                0x80


// Register: CCP2AS
#define  PICB_PSS2BD0               0x01
#define  PICB_PSS2BD1               0x02
#define  PICB_PSS2AC0               0x04
#define  PICB_PSS2AC1               0x08
#define  PICB_CCP2AS0               0x10
#define  PICB_CCP2AS1               0x20
#define  PICB_CCP2AS2               0x40
#define  PICB_CCP2ASE               0x80

// Register: PSTR2CON
#define  PICB_STR2A                 0x01
#define  PICB_STR2B                 0x02
#define  PICB_STR2C                 0x04
#define  PICB_STR2D                 0x08
#define  PICB_STR2SYNC              0x10


// Register: CCPTMRS0
#define  PICB_C1TSEL0               0x01
#define  PICB_C1TSEL1               0x02
#define  PICB_C2TSEL0               0x04
#define  PICB_C2TSEL1               0x08
#define  PICB_C3TSEL0               0x10
#define  PICB_C3TSEL1               0x20
#define  PICB_C4TSEL0               0x40
#define  PICB_C4TSEL1               0x80


// Register: CCPTMRS1
#define  PICB_C5TSEL0               0x01
#define  PICB_C5TSEL1               0x02

//
// Special function register definitions: Bank 6
//

