thtfcccj/Misc/PIC/Pic16f193xBit.h
// Register: CCP3CON
#define  PICB_CCP3M0                0x01
#define  PICB_CCP3M1                0x02
#define  PICB_CCP3M2                0x04
#define  PICB_CCP3M3                0x08
#define  PICB_DC3B0                 0x10
#define  PICB_DC3B1                 0x20
#define  PICB_P3M0                  0x40
#define  PICB_P3M1                  0x80

// Register: PWM3CON
#define  PICB_P3DC0                 0x01
#define  PICB_P3DC1                 0x02
#define  PICB_P3DC2                 0x04
#define  PICB_P3DC3                 0x08
#define  PICB_P3DC4                 0x10
#define  PICB_P3DC5                 0x20
#define  PICB_P3DC6                 0x40
#define  PICB_P3RSEN                0x80

// Register: CCP3AS
#define  PICB_PSS3BD0               0x01
#define  PICB_PSS3BD1               0x02
#define  PICB_PSS3AC0               0x04
#define  PICB_PSS3AC1               0x08
#define  PICB_CCP3AS0               0x10
#define  PICB_CCP3AS1               0x20
#define  PICB_CCP3AS2               0x40
#define  PICB_CCP3ASE               0x80

// Register: PSTR3CON
#define  PICB_STR3A                 0x01
#define  PICB_STR3B                 0x02
#define  PICB_STR3C                 0x04
#define  PICB_STR3D                 0x08
#define  PICB_STR3SYNC              0x10

// Register: CCP4CON
#define  PICB_CCP4M0                0x01
#define  PICB_CCP4M1                0x02
#define  PICB_CCP4M2                0x04
#define  PICB_CCP4M3                0x08
#define  PICB_DC4B0                 0x10
#define  PICB_DC4B1                 0x20

// Register: CCP5CON
#define  PICB_CCP5M0                0x01
#define  PICB_CCP5M1                0x02
#define  PICB_CCP5M2                0x04
#define  PICB_CCP5M3                0x08
#define  PICB_DC5B0                 0x10
#define  PICB_DC5B1                 0x20

//
// Special function register definitions: Bank 7
//


// Register: IOCBP
// Interrupt-On-Change Positive Edge Register
#define  PICB_IOCBP0                0x01
#define  PICB_IOCBP1                0x02
#define  PICB_IOCBP2                0x04
#define  PICB_IOCBP3                0x08
#define  PICB_IOCBP4                0x10
#define  PICB_IOCBP5                0x20
#define  PICB_IOCBP6                0x40
#define  PICB_IOCBP7                0x80

// Register: IOCBN
// Interrupt-On-Change Negative Edge Register
#define  PICB_IOCBN0                0x01
#define  PICB_IOCBN1                0x02
#define  PICB_IOCBN2                0x04
#define  PICB_IOCBN3                0x08
#define  PICB_IOCBN4                0x10
#define  PICB_IOCBN5                0x20
#define  PICB_IOCBN6                0x40
#define  PICB_IOCBN7                0x80

// Register: IOCBF
// Interrupt-On-Change Flag Register
#define  PICB_IOCBF0                0x01
#define  PICB_IOCBF1                0x02
#define  PICB_IOCBF2                0x04
#define  PICB_IOCBF3                0x08
#define  PICB_IOCBF4                0x10
#define  PICB_IOCBF5                0x20
#define  PICB_IOCBF6                0x40
#define  PICB_IOCBF7                0x80
//
// Special function register definitions: Bank 8
//

// bit and bitfield definitions
// Timer2 Clock Prescale Select bits
#define  PICB_T4CKPS0               0x01
// Timer2 Clock Prescale Select bits
#define  PICB_T4CKPS1               0x02
// Timer2 On bit
#define  PICB_TMR4ON                0x04
// Timer2 Output Postscaler Select bits
#define  PICB_T4OUTPS0              0x08
// Timer2 Output Postscaler Select bits
#define  PICB_T4OUTPS1              0x10
// Timer2 Output Postscaler Select bits
#define  PICB_T4OUTPS2              0x20
// Timer2 Output Postscaler Select bits
#define  PICB_T4OUTPS3              0x40

// Register: T6CON
// Timer2 Control Register
// Timer2 Clock Prescale Select bits
#define  PICB_T6CKPS0               0x01
// Timer2 Clock Prescale Select bits
#define  PICB_T6CKPS1               0x02
// Timer2 On bit
#define  PICB_TMR6ON                0x04
// Timer2 Output Postscaler Select bits
#define  PICB_T6OUTPS0              0x08
// Timer2 Output Postscaler Select bits
#define  PICB_T6OUTPS1              0x10
// Timer2 Output Postscaler Select bits
#define  PICB_T6OUTPS2              0x20
// Timer2 Output Postscaler Select bits
#define  PICB_T6OUTPS3              0x40

//
// Special function register definitions: Bank 15
//


// Register: LCDCON（LCD模块控制寄存器）
// LCD Control Register
// Commons Selection bits
#define  PICB_LMUX0                 0x01
// Commons Selection bits
#define  PICB_LMUX1                 0x02
// Clock Source bits
#define  PICB_CS0                   0x04
// Clock Source bits
#define  PICB_CS1                   0x08
// Write Failed Error bit
#define  PICB_WERR                  0x20
// LCD Display Sleep-Enabled bit
#define  PICB_SLPEN                 0x40
// LCD Module Enable bit
#define  PICB_LCDEN                 0x80

// Register: LCDPS（LCD模块时钟源配置寄存器）
// bit and bitfield definitions
// LCD Prescaler Selection bits
#define  PICB_LP0                   0x01
// LCD Prescaler Selection bits
#define  PICB_LP1                   0x02
// LCD Prescaler Selection bits
#define  PICB_LP2                   0x04
// LCD Prescaler Selection bits
#define  PICB_LP3                   0x08
// Write Allow bit
#define  PICB_WA                    0x10
// LCD Active bit
#define  PICB_LCDA                  0x20
// Bias Mode Selection bit
#define  PICB_BIASMD                0x40
// Waveform Type bit
#define  PICB_WFT                   0x80


// Register: LCDREF（LCD模块参考电压控制寄存器）
// bit and bitfield definitions
// VLCD1 pin enable bit
#define  PICB_VLCD1PE               0x02
// VLCD2 pin enable bit
#define  PICB_VLCD2PE               0x04
// VLCD3 pin enable bit
#define  PICB_VLCD3PE               0x08
// LCD Internal Reference Ladder Idle Enable bit
#define  PICB_LCDIRI                0x20
// LCD Internal Reference Source bit
#define  PICB_LCDIRS                0x40
// LCD Internal Reference Enable bit
#define  PICB_LCDIRE                0x80

// Register: LCDCST（LCD模块对比度控制寄存器）
// LCD Contrast Control Register
// LCD Contrast Control bits
#define  PICB_LCDCST0               0x01
// LCD Contrast Control bits
#define  PICB_LCDCST1               0x02
// LCD Contrast Control bits
#define  PICB_LCDCST2               0x04

