thtfcccj/Misc/PIC/Pic16f193xBit.h
// Register: LCDRL（LCD模块参考电压梯形电阻网络控制寄存器）
// LCD Reference Voltage Control Register
// LCD Reference Ladder  Time interval control bits
#define  PICB_LRLAT0                0x01
// LCD Reference Ladder  Time interval control bits
#define  PICB_LRLAT1                0x02
// LCD Reference Ladder  Time interval control bits
#define  PICB_LRLAT2                0x04
// LCD Reference Ladder B Time Power Control bits
#define  PICB_LRLBP0                0x10
// LCD Reference Ladder B Time Power Control bits
#define  PICB_LRLBP1                0x20
// LCD Reference Ladder  Time Power Control bits
#define  PICB_LRLAP0                0x40
// LCD Reference Ladder  Time Power Control bits
#define  PICB_LRLAP1                0x80

//LCDSEN(n= 0、1、2、3、4、5)：LCD 段使能寄存器
// Register: LCDSE0
#define  PICB_SE0                   0x01
#define  PICB_SE1                   0x02
#define  PICB_SE2                   0x04
#define  PICB_SE3                   0x08
#define  PICB_SE4                   0x10
#define  PICB_SE5                   0x20
#define  PICB_SE6                   0x40
#define  PICB_SE7                   0x80

// Register: LCDSE1
#define  PICB_SE8                   0x01
#define  PICB_SE9                   0x02
#define  PICB_SE10                  0x04
#define  PICB_SE11                  0x08
#define  PICB_SE12                  0x10
#define  PICB_SE13                  0x20
#define  PICB_SE14                  0x40
#define  PICB_SE15                  0x80

// Register: LCDSE2（PIC1947新增加的）
#define  PICB_SE16                  0x01
#define  PICB_SE17                  0x02
#define  PICB_SE18                  0x04
#define  PICB_SE19                  0x08
#define  PICB_SE20                  0x10
#define  PICB_SE21                  0x20
#define  PICB_SE22                  0x40
#define  PICB_SE23                  0x80

// Register: LCDSE3（PIC1947新增加的）
#define  PICB_SE24                  0x01
#define  PICB_SE25                  0x02
#define  PICB_SE26                  0x04
#define  PICB_SE27                  0x08
#define  PICB_SE28                  0x10
#define  PICB_SE29                  0x20
#define  PICB_SE30                  0x40
#define  PICB_SE31                  0x80

// Register: LCDSE4（PIC1947新增加的）
#define  PICB_SE32                  0x01
#define  PICB_SE33                  0x02
#define  PICB_SE34                  0x04
#define  PICB_SE35                  0x08
#define  PICB_SE36                  0x10
#define  PICB_SE37                  0x20
#define  PICB_SE38                  0x40
#define  PICB_SE39                  0x80

// Register: LCDSE5（PIC1947新增加的）
#define  PICB_SE40                  0x01
#define  PICB_SE41                  0x02
#define  PICB_SE42                  0x04
#define  PICB_SE43                  0x08
#define  PICB_SE44                  0x10
#define  PICB_SE45                  0x20

//LCDDATAn : LCD 数据寄存器
// Register: LCDDATA0
#define  PICB_SEG0COM0              0x01
#define  PICB_SEG1COM0              0x02
#define  PICB_SEG2COM0              0x04
#define  PICB_SEG3COM0              0x08
#define  PICB_SEG4COM0              0x10
#define  PICB_SEG5COM0              0x20
#define  PICB_SEG6COM0              0x40
#define  PICB_SEG7COM0              0x80

// Register: LCDDATA1
#define  PICB_SEG8COM0              0x01
#define  PICB_SEG9COM0              0x02
#define  PICB_SEG10COM0             0x04
#define  PICB_SEG11COM0             0x08
#define  PICB_SEG12COM0             0x10
#define  PICB_SEG13COM0             0x20
#define  PICB_SEG14COM0             0x40
#define  PICB_SEG15COM0             0x80

// Register: LCDDATA2（PIC1947新增加的）
#define  PICB_SEG16COM0             0x01
#define  PICB_SEG17COM0             0x02
#define  PICB_SEG18COM0             0x04
#define  PICB_SEG19COM0             0x08
#define  PICB_SEG20COM0             0x10
#define  PICB_SEG21COM0             0x20
#define  PICB_SEG22COM0             0x40
#define  PICB_SEG23COM0             0x80

// Register: LCDDATA3
#define  PICB_SEG0COM1              0x01
#define  PICB_SEG1COM1              0x02
#define  PICB_SEG2COM1              0x04
#define  PICB_SEG3COM1              0x08
#define  PICB_SEG4COM1              0x10
#define  PICB_SEG5COM1              0x20
#define  PICB_SEG6COM1              0x40
#define  PICB_SEG7COM1              0x80

// Register: LCDDATA4
#define  PICB_SEG8COM1              0x01
#define  PICB_SEG9COM1              0x02
#define  PICB_SEG10COM1             0x04
#define  PICB_SEG11COM1             0x08
#define  PICB_SEG12COM1             0x10
#define  PICB_SEG13COM1             0x20
#define  PICB_SEG14COM1             0x40
#define  PICB_SEG15COM1             0x80

// Register: LCDDATA5（PIC1947新增加的）
#define  PICB_SEG16COM1             0x01
#define  PICB_SEG17COM1             0x02
#define  PICB_SEG18COM1             0x04
#define  PICB_SEG19COM1             0x08
#define  PICB_SEG20COM1             0x10
#define  PICB_SEG21COM1             0x20
#define  PICB_SEG22COM1             0x40
#define  PICB_SEG23COM1             0x80

// Register: LCDDATA6
#define  PICB_SEG0COM2              0x01
#define  PICB_SEG1COM2              0x02
#define  PICB_SEG2COM2              0x04
#define  PICB_SEG3COM2              0x08
#define  PICB_SEG4COM2              0x10
#define  PICB_SEG5COM2              0x20
#define  PICB_SEG6COM2              0x40
#define  PICB_SEG7COM2              0x80

// Register: LCDDATA7
#define  PICB_SEG8COM2              0x01
#define  PICB_SEG9COM2              0x02
#define  PICB_SEG10COM2             0x04
#define  PICB_SEG11COM2             0x08
#define  PICB_SEG12COM2             0x10
#define  PICB_SEG13COM2             0x20
#define  PICB_SEG14COM2             0x40
#define  PICB_SEG15COM2             0x80


// Register: LCDDATA8（PIC1947新增加的）
#define  PICB_SEG16COM2             0x01
#define  PICB_SEG17COM2             0x02
#define  PICB_SEG18COM2             0x04
#define  PICB_SEG19COM2             0x08
#define  PICB_SEG20COM2             0x10
#define  PICB_SEG21COM2             0x20
#define  PICB_SEG22COM2             0x40
#define  PICB_SEG23COM2             0x80

// Register: LCDDATA9
#define  PICB_SEG0COM3              0x01
#define  PICB_SEG1COM3              0x02
#define  PICB_SEG2COM3              0x04
#define  PICB_SEG3COM3              0x08
#define  PICB_SEG4COM3              0x10
#define  PICB_SEG5COM3              0x20
#define  PICB_SEG6COM3              0x40
#define  PICB_SEG7COM3              0x80

// Register: LCDDATA10
#define  PICB_SEG8COM3              0x01
#define  PICB_SEG9COM3              0x02
#define  PICB_SEG10COM3             0x04
#define  PICB_SEG11COM3             0x08
#define  PICB_SEG12COM3             0x10
#define  PICB_SEG13COM3             0x20
#define  PICB_SEG14COM3             0x40
#define  PICB_SEG15COM3             0x80

// Register: LCDDATA11（PIC1947新增加的）
#define  PICB_SEG16COM3             0x01
#define  PICB_SEG17COM3             0x02
#define  PICB_SEG18COM3             0x04
#define  PICB_SEG19COM3             0x08
#define  PICB_SEG20COM3             0x10
#define  PICB_SEG21COM3             0x20
#define  PICB_SEG22COM3             0x40
#define  PICB_SEG23COM3             0x80

// Register: LCDDATA12（PIC1947新增加的）
#define  PICB_SEG24COM0             0x01
#define  PICB_SEG25COM0             0x02
#define  PICB_SEG26COM0             0x04
#define  PICB_SEG27COM0             0x08
#define  PICB_SEG28COM0             0x10
#define  PICB_SEG29COM0             0x20
#define  PICB_SEG30COM0             0x40
#define  PICB_SEG31COM0             0x80

// Register: LCDDATA13（PIC1947新增加的）
#define  PICB_SEG32COM0             0x01
#define  PICB_SEG33COM0             0x02
#define  PICB_SEG34COM0             0x04
#define  PICB_SEG35COM0             0x08
#define  PICB_SEG36COM0             0x10
#define  PICB_SEG37COM0             0x20
#define  PICB_SEG38COM0             0x40
#define  PICB_SEG39COM0             0x80

// Register: LCDDATA14（PIC1947新增加的）
#define  PICB_SEG40COM0             0x01
#define  PICB_SEG41COM0             0x02
#define  PICB_SEG42COM0             0x04
#define  PICB_SEG43COM0             0x08
#define  PICB_SEG44COM0             0x10
#define  PICB_SEG45COM0             0x20

