thtfcccj/Misc/PIC/Pic16f193xBit.h
// Register: LCDDATA15（PIC1947新增加的）
#define  PICB_SEG24COM1             0x01
#define  PICB_SEG25COM1             0x02
#define  PICB_SEG26COM1             0x04
#define  PICB_SEG27COM1             0x08
#define  PICB_SEG28COM1             0x10
#define  PICB_SEG29COM1             0x20
#define  PICB_SEG30COM1             0x40
#define  PICB_SEG31COM1             0x80

// Register: LCDDATA16（PIC1947新增加的）
#define  PICB_SEG32COM1             0x01
#define  PICB_SEG33COM1             0x02
#define  PICB_SEG34COM1             0x04
#define  PICB_SEG35COM1             0x08
#define  PICB_SEG36COM1             0x10
#define  PICB_SEG37COM1             0x20
#define  PICB_SEG38COM1             0x40
#define  PICB_SEG39COM1             0x80

// Register: LCDDATA17（PIC1947新增加的）
#define  PICB_SEG40COM1             0x01
#define  PICB_SEG41COM1             0x02
#define  PICB_SEG42COM1             0x04
#define  PICB_SEG43COM1             0x08
#define  PICB_SEG44COM1             0x10
#define  PICB_SEG45COM1             0x20

// Register: LCDDATA18（PIC1947新增加的）
#define  PICB_SEG24COM2             0x01
#define  PICB_SEG25COM2             0x02
#define  PICB_SEG26COM2             0x04
#define  PICB_SEG27COM2             0x08
#define  PICB_SEG28COM2             0x10
#define  PICB_SEG29COM2             0x20
#define  PICB_SEG30COM2             0x40
#define  PICB_SEG31COM2             0x80

// Register: LCDDATA19（PIC1947新增加的）
#define  PICB_SEG32COM2             0x01
#define  PICB_SEG33COM2             0x02
#define  PICB_SEG34COM2             0x04
#define  PICB_SEG35COM2             0x08
#define  PICB_SEG36COM2             0x10
#define  PICB_SEG37COM2             0x20
#define  PICB_SEG38COM2             0x40
#define  PICB_SEG39COM2             0x80

// Register: LCDDATA20（PIC1947新增加的）
#define  PICB_SEG40COM2             0x01
#define  PICB_SEG41COM2             0x02
#define  PICB_SEG42COM2             0x04
#define  PICB_SEG43COM2             0x08
#define  PICB_SEG44COM2             0x10
#define  PICB_SEG45COM2             0x20

// Register: LCDDATA21（PIC1947新增加的）
#define  PICB_SEG24COM3             0x01
#define  PICB_SEG25COM3             0x02
#define  PICB_SEG26COM3             0x04
#define  PICB_SEG27COM3             0x08
#define  PICB_SEG28COM3             0x10
#define  PICB_SEG29COM3             0x20
#define  PICB_SEG30COM3             0x40
#define  PICB_SEG31COM3             0x80

// Register: LCDDATA22（PIC1947新增加的）
#define  PICB_SEG32COM3             0x01
#define  PICB_SEG33COM3             0x02
#define  PICB_SEG34COM3             0x04
#define  PICB_SEG35COM3             0x08
#define  PICB_SEG36COM3             0x10
#define  PICB_SEG37COM3             0x20
#define  PICB_SEG38COM3             0x40
#define  PICB_SEG39COM3             0x80

// Register: LCDDATA23（PIC1947新增加的）
#define  PICB_SEG40COM3             0x01
#define  PICB_SEG41COM3             0x02
#define  PICB_SEG42COM3             0x04
#define  PICB_SEG43COM3             0x08
#define  PICB_SEG44COM3             0x10
#define  PICB_SEG45COM3             0x20
//
// Special function register definitions: Bank 31
//


// Register: STATUS_SHAD
#define  PICB_C_SHAD                0x01
#define  PICB_DC_SHAD               0x02
#define  PICB_Z_SHAD                0x04

#endif //#ifndef __PIC16F193X_BIT_H
